Revit 2027 API
FilterDoubleRule.RuleValue Property
 The user-supplied value against which values from a Revit document will be tested.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double RuleValue { get; set; }
Public Property RuleValue As Double
	Get
	Set
public:
property double RuleValue {
	double get ();
	void set (double value);
}
member RuleValue : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for ruleValue is not finite -or- When setting this property: The given value for ruleValue is not a number
See Also
Reference
FilterDoubleRule Class
Autodesk.Revit.DB Namespace